test/artillery/cloudrun/stock-group.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://multi-tenant-app-zmcwk2fdmq-lz.a.run.app/warehouse
  phases:
    - duration: 10
      # arrivalRate: 30
      # rampTo: 100
      arrivalRate: 30
      rampTo: 200
      name: "Case: 1 virtual users to 10 in 15 seconds"
scenarios:
  - flow:
    - loop:
      - log: "Group stock"
      - post: 
          url: "/stock/group"
          json: [
                {
                    id: 1,
                    quantity: 0,
                    location_id: 1,
                    product_id: 1,
                    unit_id: 1,
                    version: 0
                },
                {
                    id: 2,
                    base_unit: 10
                }
            ]
      count: 2
# artillery run ./test/artillery/stock-group.yml