test/artillery/cloudrun/stock-ungroup.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://multi-tenant-app-zmcwk2fdmq-lz.a.run.app/warehouse
  phases:
    - duration: 10
      # arrivalRate: 30
      # rampTo: 100
      arrivalRate: 30
      rampTo: 200
      name: "Case: 1 virtual users to 10 in 15 seconds"
scenarios:
  - flow:
    - loop:
      - log: "Ungroup stock"
      - post: 
          url: "/stock/ungroup"
          json: [
            {
              id: 2,
              quantity: 10,
              location_id: 1,
              product_id: 1,
              unit_id: 2,
              version: 0
            },
            {
              id: 1,
              base_unit: 1
            }
          ]
      count: 2
# artillery run ./test/artillery/stock-ungroup.yml